dev.gitlab:
```
Terraform will perform the following actions:

  # aws_security_group.gitlab_alb will be updated in-place
  ~ resource "aws_security_group" "gitlab_alb" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ICMP for PMTUD"
              + from_port        = 3
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 4
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0919cfd4671d09935"
        name                   = "azul-gitlab-alb"
        tags                   = {
            "Name"                = "azul-gitlab_alb"
            "billing"             = "hca"
            "component"           = "azul-gitlab_alb"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

prod.gitlab:
```
Terraform will perform the following actions:

  # aws_ec2_client_vpn_authorization_rule.gitlab must be replaced
-/+ resource "aws_ec2_client_vpn_authorization_rule" "gitlab" {
      ~ id                     = "cvpn-endpoint-05749d371fb1e4340,172.22.0.0/16" -> (known after apply)
      ~ target_network_cidr    = "172.22.0.0/16" -> "0.0.0.0/0" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ec2_client_vpn_endpoint.gitlab will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "gitlab" {
      ~ dns_servers            = [
          + "172.22.0.2",
          + "169.254.169.253",
        ]
        id                     = "cvpn-endpoint-05749d371fb1e4340"
      ~ split_tunnel           = true -> false
        tags                   = {
            "Name"                = "azul-gitlab"
            "billing"             = "hca"
            "component"           = "azul-gitlab"
            "deployment"          = "prod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ec2_client_vpn_route.gitlab_0 will be created
  + resource "aws_ec2_client_vpn_route" "gitlab_0" {
      + client_vpn_endpoint_id = "cvpn-endpoint-05749d371fb1e4340"
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + origin                 = (known after apply)
      + target_vpc_subnet_id   = "subnet-0684c75a115306ba9"
      + type                   = (known after apply)
    }

  # aws_ec2_client_vpn_route.gitlab_1 will be created
  + resource "aws_ec2_client_vpn_route" "gitlab_1" {
      + client_vpn_endpoint_id = "cvpn-endpoint-05749d371fb1e4340"
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + origin                 = (known after apply)
      + target_vpc_subnet_id   = "subnet-086a7d085dffe194f"
      + type                   = (known after apply)
    }

  # aws_instance.gitlab must be replaced
-/+ resource "aws_instance" "gitlab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:542754589326:instance/i-0768094e4bd0f21d5" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0768094e4bd0f21d5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0fad7f478537f0190" -> (known after apply)
      ~ private_dns                          = "ip-172-22-0-54.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.22.0.54" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-08a76b22ec37e1a07" -> (known after apply)
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "hca"
            "component"           = "azul-gitlab"
            "deployment"          = "prod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "28a41eadfa38581a571c38e1e51baf4a2afb4708" -> "19b3e22d1bba17d4b5d865207af628e7e0876f9f" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0c954a5a664444fe4",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 300 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:542754589326:key/606fb0cb-81df-4a09-967c-0c23853155f6" -> null
          - snapshot_id           = "snap-08c97e317c09f3e57" -> null
          - tags                  = {
              - "Name"  = "azul-gitlab"
              - "owner" = "hannes@ucsc.edu"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07a1832cc7b7273b8" -> null
          - volume_size           = 100 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:542754589326:key/606fb0cb-81df-4a09-967c-0c23853155f6" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-014d31ca7ff4a052b" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.gitlab_git must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_git" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:542754589326:targetgroup/azul-gitlab-git/75871b91a714874c-20240426213940893500000003" -> (known after apply)
      ~ target_id        = "i-0768094e4bd0f21d5" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_http must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_http" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:542754589326:targetgroup/azul-gitlab-http/630db89565bf1f3d-20240426213940794800000002" -> (known after apply)
      ~ target_id        = "i-0768094e4bd0f21d5" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_ssh must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:542754589326:targetgroup/azul-gitlab-ssh/3f5ad93fceb45135-20240426213941098600000004" -> (known after apply)
      ~ target_id        = "i-0768094e4bd0f21d5" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.gitlab_vpn will be updated in-place
  ~ resource "aws_security_group" "gitlab_vpn" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "172.22.0.0/16",
                ]
              - description      = "Any traffic to the VPC"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Any traffic to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0aa1f5ab5342fe890"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.22.0.0/16",
                ]
              - description      = "Any traffic from the VPC"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Any traffic from the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "azul-gitlab-vpn"
        tags                   = {
            "Name"                = "azul-gitlab_vpn"
            "billing"             = "hca"
            "component"           = "azul-gitlab_vpn"
            "deployment"          = "prod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_volume_attachment.gitlab must be replaced
-/+ resource "aws_volume_attachment" "gitlab" {
      ~ id          = "vai-2623030600" -> (known after apply)
      ~ instance_id = "i-0768094e4bd0f21d5" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 6 to destroy.
```

anvildev.gitlab:
```
Terraform will perform the following actions:

  # aws_security_group.gitlab_alb will be updated in-place
  ~ resource "aws_security_group" "gitlab_alb" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ICMP for PMTUD"
              + from_port        = 3
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 4
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0dce6ad44ae1590d5"
        name                   = "azul-gitlab-alb"
        tags                   = {
            "Name"                = "azul-gitlab_alb"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_alb"
            "deployment"          = "anvildev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

anvilprod.gitlab:
```
Terraform will perform the following actions:

  # aws_ec2_client_vpn_authorization_rule.gitlab must be replaced
-/+ resource "aws_ec2_client_vpn_authorization_rule" "gitlab" {
      ~ id                     = "cvpn-endpoint-024ba9048fd69288f,172.24.0.0/16" -> (known after apply)
      ~ target_network_cidr    = "172.24.0.0/16" -> "0.0.0.0/0" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_ec2_client_vpn_endpoint.gitlab will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "gitlab" {
      ~ dns_servers            = [
          + "172.24.0.2",
          + "169.254.169.253",
        ]
        id                     = "cvpn-endpoint-024ba9048fd69288f"
      ~ split_tunnel           = true -> false
        tags                   = {
            "Name"                = "azul-gitlab"
            "billing"             = "anvil"
            "component"           = "azul-gitlab"
            "deployment"          = "anvilprod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ec2_client_vpn_route.gitlab_0 will be created
  + resource "aws_ec2_client_vpn_route" "gitlab_0" {
      + client_vpn_endpoint_id = "cvpn-endpoint-024ba9048fd69288f"
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + origin                 = (known after apply)
      + target_vpc_subnet_id   = "subnet-04e3bef995e48b693"
      + type                   = (known after apply)
    }

  # aws_ec2_client_vpn_route.gitlab_1 will be created
  + resource "aws_ec2_client_vpn_route" "gitlab_1" {
      + client_vpn_endpoint_id = "cvpn-endpoint-024ba9048fd69288f"
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + origin                 = (known after apply)
      + target_vpc_subnet_id   = "subnet-0dbfb08dbed8027bf"
      + type                   = (known after apply)
    }

  # aws_iam_policy.gitlab_boundary will be updated in-place
  ~ resource "aws_iam_policy" "gitlab_boundary" {
        id        = "arn:aws:iam::465330168186:policy/azul-boundary"
        name      = "azul-boundary"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "s3:ListBucket",
                            "s3:ListAllMyBuckets",
                            "s3:GetAccountPublicAccessBlock",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  ~ {
                      ~ Resource = [
                          + "arn:aws:s3:::us-east-1-birdwatcher-prod/*",
                          + "arn:aws:s3:::us-east-1-birdwatcher-prod",
                          + "arn:aws:s3:::patch-baseline-snapshot-us-east-1/*",
                          + "arn:aws:s3:::patch-baseline-snapshot-us-east-1",
                            "arn:aws:s3:::edu-ucsc-gi-platform-anvil-*/*",
                            "arn:aws:s3:::edu-ucsc-gi-platform-anvil-*",
                          + "arn:aws:s3:::aws-windows-downloads-us-east-1/*",
                          + "arn:aws:s3:::aws-windows-downloads-us-east-1",
                          + "arn:aws:s3:::aws-ssm-us-east-1/*",
                          + "arn:aws:s3:::aws-ssm-us-east-1",
                            "arn:aws:s3:::aws-ssm-document-attachments-us-east-1/*",
                            "arn:aws:s3:::aws-ssm-document-attachments-us-east-1",
                          + "arn:aws:s3:::aws-patchmanager-macos-us-east-1/*",
                          + "arn:aws:s3:::aws-patchmanager-macos-us-east-1",
                          + "arn:aws:s3:::amazon-ssm-us-east-1/*",
                          + "arn:aws:s3:::amazon-ssm-us-east-1",
                            "arn:aws:s3:::amazon-ssm-packages-us-east-1/*",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:ListKeys",
                            "kms:ListAliases",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (28 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "Name"                = "azul-gitlab_boundary"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_boundary"
            "deployment"          = "anvilprod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.gitlab_iam will be updated in-place
  ~ resource "aws_iam_policy" "gitlab_iam" {
        id        = "arn:aws:iam::465330168186:policy/azul-gitlab-iam"
        name      = "azul-gitlab-iam"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (12 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:UpdateKeyDescription",
                            "kms:UpdateAlias",
                            "kms:UntagResource",
                            "kms:TagResource",
                            "kms:ScheduleKeyDeletion",
                            "kms:DeleteAlias",
                            "kms:CreateAlias",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:us-east-1:465330168186:key/*",
                            "arn:aws:kms:us-east-1:465330168186:alias/*",
                        ]
                    },
                  ~ {
                      ~ Resource = [
                          + "arn:aws:s3:::us-east-1-birdwatcher-prod/*",
                          + "arn:aws:s3:::us-east-1-birdwatcher-prod",
                          + "arn:aws:s3:::patch-baseline-snapshot-us-east-1/*",
                          + "arn:aws:s3:::patch-baseline-snapshot-us-east-1",
                          + "arn:aws:s3:::aws-windows-downloads-us-east-1/*",
                          + "arn:aws:s3:::aws-windows-downloads-us-east-1",
                          + "arn:aws:s3:::aws-ssm-us-east-1/*",
                          + "arn:aws:s3:::aws-ssm-us-east-1",
                            "arn:aws:s3:::aws-ssm-document-attachments-us-east-1/*",
                            "arn:aws:s3:::aws-ssm-document-attachments-us-east-1",
                          + "arn:aws:s3:::aws-patchmanager-macos-us-east-1/*",
                          + "arn:aws:s3:::aws-patchmanager-macos-us-east-1",
                          + "arn:aws:s3:::amazon-ssm-us-east-1/*",
                          + "arn:aws:s3:::amazon-ssm-us-east-1",
                            "arn:aws:s3:::amazon-ssm-packages-us-east-1/*",
                            # (1 unchanged element hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "Name"                = "azul-gitlab_iam"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_iam"
            "deployment"          = "anvilprod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_instance.gitlab must be replaced
-/+ resource "aws_instance" "gitlab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:465330168186:instance/i-04fa6a3a2a4b59e19" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-04fa6a3a2a4b59e19" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05e604674929d467d" -> (known after apply)
      ~ private_dns                          = "ip-172-24-0-206.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.24.0.206" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-05411c258e55e6358" -> (known after apply)
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "anvil"
            "component"           = "azul-gitlab"
            "deployment"          = "anvilprod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "314dbe58243a84cc12d7537847af0d3ec8debbdb" -> "cf53bfbf96d688709904d1c5a955aca1f664fc0a" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0f790b7ba9e103154",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 450 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:465330168186:key/7c40e9c9-a2c0-4f9c-85e4-3848f1ea3761" -> null
          - snapshot_id           = "snap-0532f3b70a046b552" -> null
          - tags                  = {
              - "Name" = "azul-gitlab"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0cdc24e5653dbac6b" -> null
          - volume_size           = 150 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:465330168186:key/7c40e9c9-a2c0-4f9c-85e4-3848f1ea3761" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-04f80442550c38101" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.gitlab_git must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_git" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:465330168186:targetgroup/azul-gitlab-git/6e4e376af92445e7-20240419191901302600000003" -> (known after apply)
      ~ target_id        = "i-04fa6a3a2a4b59e19" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_http must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_http" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:465330168186:targetgroup/azul-gitlab-http/9921a2e999b7b6bb-20240419191901222400000002" -> (known after apply)
      ~ target_id        = "i-04fa6a3a2a4b59e19" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_ssh must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:465330168186:targetgroup/azul-gitlab-ssh/a2b97eae02441829-20240419191901555100000004" -> (known after apply)
      ~ target_id        = "i-04fa6a3a2a4b59e19" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.gitlab_vpn will be updated in-place
  ~ resource "aws_security_group" "gitlab_vpn" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "172.24.0.0/16",
                ]
              - description      = "Any traffic to the VPC"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Any traffic to the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0e1e2d0fc01b80c1a"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.24.0.0/16",
                ]
              - description      = "Any traffic from the VPC"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Any traffic from the internet"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "azul-gitlab-vpn"
        tags                   = {
            "Name"                = "azul-gitlab_vpn"
            "billing"             = "anvil"
            "component"           = "azul-gitlab_vpn"
            "deployment"          = "anvilprod"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_volume_attachment.gitlab must be replaced
-/+ resource "aws_volume_attachment" "gitlab" {
      ~ id          = "vai-1343270804" -> (known after apply)
      ~ instance_id = "i-04fa6a3a2a4b59e19" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 8 to add, 4 to change, 6 to destroy.
```